In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns = ['W','X','Y','Z'],
                   index = ['Dog','Cat','Bird','Mouse'])

In [3]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [4]:
animals.ix[1:2,['W','Y']] = np.nan
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat   NaN   5 NaN   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [5]:
behaviour_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}

In [6]:
animal_col = animals.groupby(behaviour_map,axis=1)
animal_col.sum()

       bad  good
Dog      4     2
Cat     12   NaN
Bird    20    18
Mouse   28    26

In [7]:
behav_series = Series(behaviour_map)
behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [8]:
animals.groupby(behav_series,axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [9]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat   NaN   5 NaN   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [10]:
animals.groupby(behav_series,axis=1).sum()

       bad  good
Dog      4     2
Cat     12   NaN
Bird    20    18
Mouse   28    26

In [11]:
animals.groupby(len).sum()

    W   X   Y   Z
3   0   6   2  10
4   8   9  10  11
5  12  13  14  15

In [12]:
keys = ['A','B','A','B']

In [13]:
animals.groupby([len,keys]).max()

      W   X   Y   Z
3 A   0   1   2   3
  B NaN   5 NaN   7
4 A   8   9  10  11
5 B  12  13  14  15

In [15]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],
                                       [1,2,3,1,2]],
                                     names=['cities','sub_value'])

In [17]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)

In [18]:
dframe_hr = dframe_hr * 100

In [19]:
dframe_hr

cities       NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400